Tekla Open API Reference for Tekla Structures 2025
Parallel.LineSegmentToLineSegment Method (LineSegment, LineSegment)
 Returns true if the given line segments are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool LineSegmentToLineSegment(
	LineSegment LineSegment1,
	LineSegment LineSegment2
)
Public Shared Function LineSegmentToLineSegment (
	LineSegment1 As LineSegment,
	LineSegment2 As LineSegment
) As Boolean
Parameters
LineSegment1
Type: Tekla.Structures.Geometry3d.LineSegment
The first line segment to be used.
LineSegment2
Type: Tekla.Structures.Geometry3d.LineSegment
The second line segment to be used.
Return Value
Type: Boolean
True if the given line segments are parallel.
See Also
Reference
Parallel Class
LineSegmentToLineSegment Overload
Tekla.Structures.Geometry3d Namespace